DataProcessors/ОтражениеДокументовВБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ОтражениеДокументовВБухгалтерии</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПубличныеИдентификаторыБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПубличныеИдентификаторыБухгалтерии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПубличныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроблемыПриОбмене</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФорматаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияПравилаПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибкиОтражения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроблемыПриПроверке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Множественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязанныеИдентификаторы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>700</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дополнительный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НавигационнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИнициалыИмени</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФИОСлужебные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СистемыНалогообложенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СистемыНалогообложенияОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяПатент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикТорговыйСбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РозничнаяПродажаАлкоголя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышеннаяСтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДСПрименяющийУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийПлатежноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПлатежноеПоручение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатыСамозанятым</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаСамозанятому</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсобыйПорядок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУСН</Name>
					<Comment>Автоматизированная УСН</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОбъектовНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыМинусРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ОтражениеДокументовВБухгалтерии/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Для выполнения в Фоновом задании.
//
Функция ПодготовитьДанныеМонитора(Параметры) Экспорт
	
	Если Параметры.ВыполнитьОбновлениеДанных Тогда
		// 1. Запуск обмена данными.
		
		// 2. Синхронизация результатов обмена и выполнение проверок.
		РегистрыСведений.ПубличныеИдентификаторыБухгалтерии.ВыполнитьОбновлениеДанных();
	КонецЕсли;
	
	// 3. Подготовка данных для монитора.
	ОписаниеЗапроса = ОписаниеЗапросаДетальныхЗаписейОтраженияДокументов(Параметры.Отборы);
	
	Запрос = Новый Запрос(ОписаниеЗапроса.Текст);
	
	Для Каждого ОписаниеПараметра Из ОписаниеЗапроса.Параметры Цикл
		Запрос.УстановитьПараметр(ОписаниеПараметра.Ключ, ОписаниеПараметра.Значение);
	КонецЦикла;
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	ДанныеОтражения = Новый Структура;
	ДанныеОтражения.Вставить("ТаблицаДокументов", ТаблицаДокументов);
	
	Возврат ДанныеОтражения;
	
КонецФункции

Функция ОписаниеЗапросаДетальныхЗаписейОтраженияДокументов(Отборы) Экспорт

	ОписаниеЗапроса = Новый Структура;
	ОписаниеЗапроса.Вставить("Текст", "");
	ОписаниеЗапроса.Вставить("Параметры", Новый Структура);
	
	НастройкиУзлаОбмена = Справочники.НастройкиОтраженияДокументовВБухгалтерии.НастройкиУзлаОбмена();  
	УзелОбмена = НастройкиУзлаОбмена.УзелОбмена;
	
	СоставПланаОбмена = УзелОбмена.Метаданные().Состав;
	
	ТекстыЗапросов = Новый Массив;

	// 1. Объекты есть в бухгалтерии и должны быть выгружены в УНФ, но не выгружены. 
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ИдентификаторыБухгалтерии.Идентификатор) КАК Идентификатор,
	|	МАКСИМУМ(ИдентификаторыБухгалтерии.ИдентификаторМетаданных) КАК ИдентификаторМетаданных,
	|	МАКСИМУМ(ИдентификаторыБухгалтерии.ЕстьОшибкиОтражения) КАК ЕстьОшибкиОтражения,
	|	МИНИМУМ(ИдентификаторыБухгалтерии.Проведен) КАК Проведен,
	|	МАКСИМУМ(ИдентификаторыБухгалтерии.Множественный) КАК Множественный,
	|	ИдентификаторыБухгалтерии.ПубличныйИдентификатор КАК ПубличныйИдентификатор,
	|	МАКСИМУМ(ИдентификаторыБухгалтерии.СвязанныеИдентификаторы) КАК СвязанныеИдентификаторы
	|ПОМЕСТИТЬ СгруппированныеИдентификаторыБухгалтерии
	|ИЗ
	|	РегистрСведений.ПубличныеИдентификаторыБухгалтерии КАК ИдентификаторыБухгалтерии
	|
	|СГРУППИРОВАТЬ ПО
	|	ИдентификаторыБухгалтерии.ПубличныйИдентификатор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	NULL КАК Ссылка,
	|	ИдентификаторыБухгалтерии.ПубличныйИдентификатор КАК ПубличныйИдентификатор,
	|	ИдентификаторыБухгалтерии.Идентификатор КАК Идентификатор_Бухгалтерия,
	|	ИдентификаторыБухгалтерии.ИдентификаторМетаданных КАК ИдентификаторМетаданных_Бухгалтерия,
	|	ИдентификаторыБухгалтерии.РазделУчета КАК РазделУчета,
	|	ИдентификаторыБухгалтерии.ЕстьОшибкиОтражения КАК ЕстьОшибкиОтражения,
	|	ИдентификаторыБухгалтерии.Номер КАК Номер,
	|	ИдентификаторыБухгалтерии.Дата КАК Дата,
	|	ПубличныеИдентификаторыОрганизации.Ссылка КАК Организация,
	|	ИдентификаторыБухгалтерии.СуммаДокумента КАК СуммаДокумента,
	|	ЛОЖЬ КАК ОтраженВБизнесе,
	|	ИдентификаторыБухгалтерии.Проведен КАК ОтраженВБухгалтерии,
	|	"""" КАК ТипДокумента,
	|	ИдентификаторыБухгалтерии.ВидОперации КАК ВидОперации,
	|	""НеОтражен"" КАК Статус,
	|	ИдентификаторыБухгалтерии.Множественный КАК Множественный,
	|	ИдентификаторыБухгалтерии.СвязанныеИдентификаторы КАК СвязанныеИдентификаторы
	|ИЗ
	|	РегистрСведений.ПубличныеИдентификаторыБухгалтерии КАК ИдентификаторыБухгалтерии
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторы
	|		ПО (ПубличныеИдентификаторы.Идентификатор = ИдентификаторыБухгалтерии.ПубличныйИдентификатор)
	|			И (ПубличныеИдентификаторы.УзелИнформационнойБазы = &УзелОбмена)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыОрганизации
	|		ПО (ПубличныеИдентификаторыОрганизации.Идентификатор = ИдентификаторыБухгалтерии.Организация)
	|			И (ПубличныеИдентификаторыОрганизации.УзелИнформационнойБазы = &УзелОбмена)
	|			И (ПубличныеИдентификаторыОрганизации.Ссылка ССЫЛКА Справочник.Организации)
	|ГДЕ
	|	ПубличныеИдентификаторы.Ссылка ЕСТЬ NULL";
	
	Если Отборы.Организации.Количество() > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И ПубличныеИдентификаторыОрганизации.Ссылка В (&ОтборОрганизации)";
	КонецЕсли;
	Если Отборы.ТипыДокумента.Количество() > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И """" В (&ОтборТипыДокумента)";
	КонецЕсли;
	Если ЗначениеЗаполнено(Отборы.Период.ДатаНачала) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И ИдентификаторыБухгалтерии.Дата >= &ОтборДатаНачала";
	КонецЕсли;
	Если ЗначениеЗаполнено(Отборы.Период.ДатаОкончания) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И ИдентификаторыБухгалтерии.Дата <= &ОтборДатаОкончания";
	КонецЕсли;
	Если Отборы.РазделыУчета.Количество() > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И ИдентификаторыБухгалтерии.РазделУчета В (&ОтборРазделыУчета)";
	КонецЕсли;
	Если Отборы.Статусы.Количество() > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И (""НеОтражен"" В (&ОтборСтатусы) ИЛИ ""НеОтраженВБизнесе"" В (&ОтборСтатусы))";
	КонецЕсли;
	Если Отборы.Свойство("СсылкаНаДокумент") И  ЗначениеЗаполнено(Отборы.СсылкаНаДокумент) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И ЛОЖЬ";
	КонецЕсли;
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ИсточникиДанных = СовместноеИспользование.ИсточникиДанныхСинхронизируемыхОбъектов();
	
	Для Каждого ОписаниеИсточника Из ИсточникиДанных Цикл
		Если Отборы.РазделыУчета.Количество() > 0
			И Отборы.РазделыУчета.Найти(ОписаниеИсточника.ИдентификаторРаздела) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
 		Если НЕ НастройкиУзлаОбмена.ИспользоватьОтборПоВидамЦен 
			И ОписаниеИсточника.ИмяТаблицы = "Документ.УстановкаЦенНоменклатуры" Тогда
			Продолжить;
		КонецЕсли;    

		Если СоставПланаОбмена.Содержит(ОписаниеИсточника.МетаданныеОбъекта) Тогда
			// 2. Объекты есть в УНФ, были выгружены в бухгалтерию.
			// На стороне бухгалтерии могли быть загружены, моли быть не загружены.
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ТаблицаДокумента.Ссылка КАК Ссылка,
			|	ПубличныеИдентификаторы.Идентификатор КАК ПубличныйИдентификатор,
			|	ИдентификаторыБухгалтерии.Идентификатор КАК Идентификатор_Бухгалтерия,
			|	ИдентификаторыБухгалтерии.ИдентификаторМетаданных КАК ИдентификаторМетаданных_Бухгалтерия,
			|	""#ИдентификаторРаздела"" КАК РазделУчета,
			|	ЕСТЬNULL(ИдентификаторыБухгалтерии.ЕстьОшибкиОтражения, ЛОЖЬ) КАК ЕстьОшибкиОтражения,
			|	ТаблицаДокумента.Номер КАК Номер,
			|	ТаблицаДокумента.Дата КАК Дата,
			|	ТаблицаДокумента.Организация КАК Организация,
			|	ТаблицаДокумента.СуммаДокумента КАК СуммаДокумента,
			|	ТаблицаДокумента.Проведен КАК ОтраженВБизнесе,
			|	ЕСТЬNULL(ИдентификаторыБухгалтерии.Проведен, ЛОЖЬ) КАК ОтраженВБухгалтерии,
			|	#СинонимМетаданных КАК ТипДокумента,
			|	ТаблицаДокумента.ВидОперации КАК ВидОперации,
			|	ВЫБОР
			|		КОГДА НЕ ТаблицаДокумента.Проведен
			|				ИЛИ НЕ ЕСТЬNULL(ИдентификаторыБухгалтерии.Проведен, ЛОЖЬ)
			|			ТОГДА ""НеОтражен""
			|		КОГДА ЕСТЬNULL(ИдентификаторыБухгалтерии.ЕстьОшибкиОтражения, ЛОЖЬ)
			|			ТОГДА ""ЕстьРасхождения""
			|		ИНАЧЕ ""Отражен""
			|	КОНЕЦ КАК Статус,
			|	ИдентификаторыБухгалтерии.Множественный КАК Множественный,
			|	ИдентификаторыБухгалтерии.СвязанныеИдентификаторы КАК СвязанныеИдентификаторы
			|ИЗ
			|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторы
			|		ЛЕВОЕ СОЕДИНЕНИЕ СгруппированныеИдентификаторыБухгалтерии КАК ИдентификаторыБухгалтерии
			|		ПО (ИдентификаторыБухгалтерии.ПубличныйИдентификатор = ПубличныеИдентификаторы.Идентификатор)
			|		ЛЕВОЕ СОЕДИНЕНИЕ #ТекстПодзапроса КАК ТаблицаДокумента
			|		ПО (ТаблицаДокумента.Ссылка = ПубличныеИдентификаторы.Ссылка)
			|ГДЕ
			|	ПубличныеИдентификаторы.УзелИнформационнойБазы = &УзелОбмена
			|	И НЕ ТаблицаДокумента.Ссылка ЕСТЬ NULL";
			
			ТекстЗапроса = ТекстЗапроса + "
			|	И ПубличныеИдентификаторы.Ссылка ССЫЛКА " + ОписаниеИсточника.ИмяТаблицы;
			
			Если Отборы.Организации.Количество() > 0 Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И ТаблицаДокумента.Организация В (&ОтборОрганизации)";
			КонецЕсли;
			Если Отборы.ТипыДокумента.Количество() > 0 Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И #СинонимМетаданных В (&ОтборТипыДокумента)";
			КонецЕсли;
			Если ЗначениеЗаполнено(Отборы.Период.ДатаНачала) Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И ТаблицаДокумента.Дата >= &ОтборДатаНачала";
			КонецЕсли;
			Если ЗначениеЗаполнено(Отборы.Период.ДатаОкончания) Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И ТаблицаДокумента.Дата <= &ОтборДатаОкончания";
			КонецЕсли;    
			
			Если НастройкиУзлаОбмена.ПереноситьЗаказыКакСчетаНаОплату 
				И ОписаниеИсточника.ИмяТаблицы = "Документ.СчетНаОплату" Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И ЕСТЬNULL(ИдентификаторыБухгалтерии.Проведен, ЛОЖЬ) ";
			ИначеЕсли НЕ НастройкиУзлаОбмена.ПереноситьЗаказыКакСчетаНаОплату 
				И ОписаниеИсточника.ИмяТаблицы = "Документ.ЗаказПокупателя"
				И Найти (ОписаниеИсточника.ТекстЗапроса, "ТЗаказНаряд") = 0 Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И ЕСТЬNULL(ИдентификаторыБухгалтерии.Проведен, ЛОЖЬ) ";
			КонецЕсли;     
				
			Если ОписаниеИсточника.ИмяТаблицы = "Документ.ПлатежноеПоручение" Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И НЕ ТаблицаДокумента.ВидОперацииЗначение В(&ЗапрещенныеОперацииПоручения) ";
  			КонецЕсли;     

			Если Отборы.Статусы.Количество() > 0 Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И ВЫБОР
				|	    КОГДА НЕ ТаблицаДокумента.Проведен ИЛИ НЕ ЕСТЬNULL(ИдентификаторыБухгалтерии.Проведен, ЛОЖЬ) ТОГДА ""НеОтражен""
				|	    КОГДА ЕСТЬNULL(ИдентификаторыБухгалтерии.ЕстьОшибкиОтражения, ЛОЖЬ) ТОГДА ""ЕстьРасхождения""
				|	    ИНАЧЕ ""Отражен""
				|	КОНЕЦ В (&ОтборСтатусы)";
				ТекстЗапроса = ТекстЗапроса + "
				|	И ВЫБОР
				|	    КОГДА НЕ ТаблицаДокумента.Проведен ТОГДА ""НеОтраженВБизнесе""
				|	    КОГДА НЕ ЕСТЬNULL(ИдентификаторыБухгалтерии.Проведен, ЛОЖЬ) ТОГДА ""НеОтраженВБухгалтерии""
				|	КОНЕЦ В (&ОтборСтатусы)";
			КонецЕсли;
			Если Отборы.Свойство("СсылкаНаДокумент") И  ЗначениеЗаполнено(Отборы.СсылкаНаДокумент) Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И ПубличныеИдентификаторы.Ссылка = &СсылкаНаДокумент";
			КонецЕсли;
				
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИдентификаторРаздела", ОписаниеИсточника.ИдентификаторРаздела);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТекстПодзапроса", "(" + ОписаниеИсточника.ТекстЗапроса + ")");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#СинонимМетаданных", """" + ОписаниеИсточника.МетаданныеОбъекта.Синоним + """");
			ТекстыЗапросов.Добавить(ТекстЗапроса);
		
			// 3. Объекты есть в УНФ, зарегистрированы к обмену, но еще не выгружались.
			Если НастройкиУзлаОбмена.ПереноситьЗаказыКакСчетаНаОплату 
				И ОписаниеИсточника.ИмяТаблицы = "Документ.СчетНаОплату" Тогда
				Продолжить;
			ИначеЕсли НЕ НастройкиУзлаОбмена.ПереноситьЗаказыКакСчетаНаОплату 
				И ОписаниеИсточника.ИмяТаблицы = "Документ.ЗаказПокупателя"
				И Найти (ОписаниеИсточника.ТекстЗапроса, "ТЗаказНаряд") = 0 Тогда
				Продолжить;
			КонецЕсли;     

			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ТаблицаДокумента.Ссылка КАК Ссылка,
			|	NULL КАК ПубличныйИдентификатор,
			|	NULL КАК Идентификатор_Бухгалтерия,
			|	NULL КАК ИдентификаторМетаданных_Бухгалтерия,
			|	""#ИдентификаторРаздела"" КАК РазделУчета,
			|	ЛОЖЬ КАК ЕстьОшибкиОтражения,
			|	ТаблицаДокумента.Номер КАК Номер,
			|	ТаблицаДокумента.Дата КАК Дата,
			|	ТаблицаДокумента.Организация КАК Организация,
			|	ТаблицаДокумента.СуммаДокумента КАК СуммаДокумента,
			|	ТаблицаДокумента.Проведен КАК ОтраженВБизнесе,
			|	ЛОЖЬ КАК ОтраженВБухгалтерии,
			|	#СинонимМетаданных КАК ТипДокумента,
			|	ТаблицаДокумента.ВидОперации КАК ВидОперации,
			|	""НеОтражен"" КАК Статус,
			|	ЛОЖЬ КАК Множественный,
			|	"""" КАК СвязанныеИдентификаторы
			|ИЗ
			|	#ТаблицаИзмененийОбъекта КАК ТаблицаИзменений
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторы
			|		ПО (ПубличныеИдентификаторы.Ссылка = ТаблицаИзменений.Ссылка)
			|			И (ПубличныеИдентификаторы.УзелИнформационнойБазы = ТаблицаИзменений.Узел)
			|		ЛЕВОЕ СОЕДИНЕНИЕ #ТекстПодзапроса КАК ТаблицаДокумента
			|		ПО (ТаблицаДокумента.Ссылка = ТаблицаИзменений.Ссылка)
			|ГДЕ
			|	ТаблицаИзменений.Узел = &УзелОбмена
			|	И НЕ ТаблицаДокумента.Ссылка ЕСТЬ NULL
			|	И ПубличныеИдентификаторы.Ссылка ЕСТЬ NULL";
			
			Если Отборы.Организации.Количество() > 0 Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И ТаблицаДокумента.Организация В (&ОтборОрганизации)";
			КонецЕсли;
			Если Отборы.ТипыДокумента.Количество() > 0 Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И #СинонимМетаданных В (&ОтборТипыДокумента)";
			КонецЕсли;
			Если ЗначениеЗаполнено(Отборы.Период.ДатаНачала) Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И ТаблицаДокумента.Дата >= &ОтборДатаНачала";
			КонецЕсли;
			Если ЗначениеЗаполнено(Отборы.Период.ДатаОкончания) Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И ТаблицаДокумента.Дата <= &ОтборДатаОкончания";
			КонецЕсли;
			Если Отборы.Статусы.Количество() > 0 Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И (""НеОтражен"" В (&ОтборСтатусы) ИЛИ ""НеОтраженВБухгалтерии"" В (&ОтборСтатусы))";
			КонецЕсли;
			Если Отборы.Свойство("СсылкаНаДокумент") И  ЗначениеЗаполнено(Отборы.СсылкаНаДокумент) Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И ПубличныеИдентификаторы.Ссылка = &СсылкаНаДокумент";
			КонецЕсли;
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИдентификаторРаздела", ОписаниеИсточника.ИдентификаторРаздела);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТаблицаИзмененийОбъекта", ОписаниеИсточника.ИмяТаблицы + ".Изменения");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТекстПодзапроса", "(" + ОписаниеИсточника.ТекстЗапроса + ")");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#СинонимМетаданных", """" + ОписаниеИсточника.МетаданныеОбъекта.Синоним + """");
			ТекстыЗапросов.Добавить(ТекстЗапроса);
		КонецЕсли;
	КонецЦикла;
	
	Разделитель = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";
	
	ОписаниеЗапроса.Текст = СтрСоединить(ТекстыЗапросов, Разделитель);
	
	ОписаниеЗапроса.Параметры.Вставить("УзелОбмена", УзелОбмена);
	
	Если Отборы.Организации.Количество() > 0 Тогда
		ОписаниеЗапроса.Параметры.Вставить("ОтборОрганизации", ОбщегоНазначения.СкопироватьРекурсивно(Отборы.Организации));
	КонецЕсли;
	Если Отборы.ТипыДокумента.Количество() > 0 Тогда
		ОписаниеЗапроса.Параметры.Вставить("ОтборТипыДокумента", ОбщегоНазначения.СкопироватьРекурсивно(Отборы.ТипыДокумента));
	КонецЕсли;
	Если ЗначениеЗаполнено(Отборы.Период.ДатаНачала) Тогда
		ОписаниеЗапроса.Параметры.Вставить("ОтборДатаНачала", Отборы.Период.ДатаНачала);
	КонецЕсли;
	Если ЗначениеЗаполнено(Отборы.Период.ДатаОкончания) Тогда
		ОписаниеЗапроса.Параметры.Вставить("ОтборДатаОкончания", Отборы.Период.ДатаОкончания);
	КонецЕсли;
	Если Отборы.РазделыУчета.Количество() > 0 Тогда
		ОписаниеЗапроса.Параметры.Вставить("ОтборРазделыУчета", ОбщегоНазначения.СкопироватьРекурсивно(Отборы.РазделыУчета));
	КонецЕсли;
	Если Отборы.Статусы.Количество() > 0 Тогда
		ОписаниеЗапроса.Параметры.Вставить("ОтборСтатусы", ОбщегоНазначения.СкопироватьРекурсивно(Отборы.Статусы));
	КонецЕсли;
	Если Отборы.Свойство("СсылкаНаДокумент") И  ЗначениеЗаполнено(Отборы.СсылкаНаДокумент) Тогда
		ОписаниеЗапроса.Параметры.Вставить("СсылкаНаДокумент", Отборы.СсылкаНаДокумент);
	КонецЕсли;      
	МассивВидовОпераций = Новый Массив;  
	МассивВидовОпераций.Добавить(Перечисления.ВидыОперацийПлатежноеПоручение.Зарплата);
	МассивВидовОпераций.Добавить(Перечисления.ВидыОперацийПлатежноеПоручение.ЗарплатаСотруднику);
	МассивВидовОпераций.Добавить(Перечисления.ВидыОперацийПлатежноеПоручение.ПереводНаДругойСчет);
	МассивВидовОпераций.Добавить(Перечисления.ВидыОперацийПлатежноеПоручение.Подотчетнику);
	МассивВидовОпераций.Добавить(Перечисления.ВидыОперацийПлатежноеПоручение.ЛичныеСредстваПредпринимателя);
	МассивВидовОпераций.Добавить(Перечисления.ВидыОперацийПлатежноеПоручение.ВыплатаСамозанятому);
	МассивВидовОпераций.Добавить(Перечисления.ВидыОперацийПлатежноеПоручение.ВыплатыСамозанятым);
	
	ОписаниеЗапроса.Параметры.Вставить("ЗапрещенныеОперацииПоручения", МассивВидовОпераций);
	
	Возврат ОписаниеЗапроса;
	
КонецФункции

// Для выполнения в Фоновом задании.
//
Функция СостояниеУчетнойПолитикиОрганизации(ПубличныеИдентификаторы, Период) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ОписаниеПодключения = СовместноеИспользованиеИнтеграция.НовоеПодключениеКСервису();
	УстановитьПривилегированныйРежим(Ложь);
	
	СостояниеУчетнойПолитики = Новый Соответствие;
	
	Для Каждого Идентификатор Из ПубличныеИдентификаторы Цикл
		СостояниеУчетнойПолитики.Вставить(Идентификатор,
			СовместноеИспользованиеИнтеграция.УчетнаяПолитикаОрганизации(ОписаниеПодключения, Идентификатор, Период));
	КонецЦикла;
	
	СовместноеИспользованиеИнтеграция.ЗавершитьСеанс(ОписаниеПодключения);
	
	Возврат СостояниеУчетнойПолитики;
	
КонецФункции

// Для выполнения в Фоновом задании.
//
Функция ПолучитьНастройкиПриложения() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ОписаниеПодключения = СовместноеИспользованиеИнтеграция.НовоеПодключениеКСервису();
	УстановитьПривилегированныйРежим(Ложь);

	Если ОписаниеПодключения = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкиПриложения = СовместноеИспользованиеИнтеграция.ПолучитьНастройкиПриложения(ОписаниеПодключения);
	
	СовместноеИспользованиеИнтеграция.ЗавершитьСеанс(ОписаниеПодключения);
	
	Возврат НастройкиПриложения;
	
КонецФункции

// Для выполнения в Фоновом задании.
//
Функция ВыполнитьНачальнуюВыгрузкуОрганизации(УзелОбмена, Организация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ОписаниеПодключения = СовместноеИспользованиеИнтеграция.НовоеПодключениеКСервису(, 120);
	УстановитьПривилегированныйРежим(Ложь);
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("entity", ПолучитьОписаниеОрганизации(Организация));
	
	РезультатНастройки = СовместноеИспользованиеИнтеграция.НастроитьОрганизацию(ОписаниеПодключения, ДанныеЗапроса);
	Если РезультатНастройки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗафиксироватьВыгрузкуОрганизации(Организация, РезультатНастройки.uuid, УзелОбмена);
	
	Возврат Истина;
	
КонецФункции

// Для выполнения в Фоновом задании.
//
Функция ВыполнитьНачальнуюВыгрузкуНесколькихОрганизаций(УзелОбмена, МассивОрганизаций) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Ложь);
	Результат.Вставить("СообщениеОбОшибке", "");
	
	УстановитьПривилегированныйРежим(Истина);
	ОписаниеПодключения = СовместноеИспользованиеИнтеграция.НовоеПодключениеКСервису(, 120);
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого Организация Из МассивОрганизаций Цикл
		ОшибкиПроверкиЗаполнения = Неопределено;
		
		ДанныеЗапроса = Новый Структура;
		ДанныеЗапроса.Вставить("entity", ПолучитьОписаниеОрганизации(Организация, ОшибкиПроверкиЗаполнения));
		
		Если ОшибкиПроверкиЗаполнения.Количество() > 0 Тогда
			Результат.Отказ = Истина;
			Результат.СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'При настройке организации %1 возникли ошибки:
				|%2.'"),
				Организация,
				СтрСоединить(ОшибкиПроверкиЗаполнения, Символы.ПС));
			Возврат Результат;
		КонецЕсли;
		
		РезультатНастройки = СовместноеИспользованиеИнтеграция.НастроитьОрганизацию(ОписаниеПодключения, ДанныеЗапроса);
		Если РезультатНастройки = Неопределено Тогда
			Результат.Отказ = Истина;
			Результат.СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось настроить организацию %1.'"),
				Организация);
			Возврат Результат;
		КонецЕсли;
		
		ЗафиксироватьВыгрузкуОрганизации(Организация, РезультатНастройки.uuid, УзелОбмена);
	КонецЦикла;
	
	СовместноеИспользованиеИнтеграция.ЗавершитьСеанс(ОписаниеПодключения);
	
	Возврат Результат;
	
КонецФункции

// Для выполнения в Фоновом задании.
//
Функция ПолучитьНастройкиСовместногоИспользования(НастройкаСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ОписаниеПодключения = СовместноеИспользованиеИнтеграция.НовоеПодключениеКСервису();
	УстановитьПривилегированныйРежим(Ложь);
	
	Настройки = СовместноеИспользованиеИнтеграция.ПолучитьНастройкиСовместногоИспользования(ОписаниеПодключения, НастройкаСсылка);
	
	СовместноеИспользованиеИнтеграция.ЗавершитьСеанс(ОписаниеПодключения);
	
	Возврат Настройки;
	
КонецФункции

#Область ПодсистемаОбменДанными

// Для выполнения в Фоновом задании.
//
Функция НастройкиПодключенияКПриложениюВСервисе(НомерОбласти) Экспорт
	
	МодульПомощника = ОбменДаннымиСервер.МодульПомощникНастройкиСинхронизацииДанныхМеждуПриложениямиВИнтернете();
	
	Настройки = Новый Структура;
	Настройки.Вставить("Режим", "НеНастроенныеОбмены");
	Настройки.Вставить("ИмяПланаОбмена", ИмяПланаОбмена());
	Настройки.Вставить("ФорматОбмена", ФорматОбмена());
	Настройки.Вставить("ИдентификаторНастройки", ВариантНастройкиОбмена());
	
	СтатусЗавершения = Неопределено;
	
	ПараметрыОбработчика = Неопределено;
	ПродолжитьОжидание = Ложь;
	
	МодульПомощника.ПриНачалеПолученияСпискаПриложений(Настройки, ПараметрыОбработчика, ПродолжитьОжидание);
	
	Пока ПродолжитьОжидание Цикл
		ОбменДаннымиСервер.Пауза(1);
		МодульПомощника.ПриОжиданииПолученияСпискаПриложений(ПараметрыОбработчика, ПродолжитьОжидание);
	КонецЦикла;
	
	МодульПомощника.ПриЗавершенииПолученияСпискаПриложений(ПараметрыОбработчика, СтатусЗавершения);
	
	Если СтатусЗавершения.Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаПриложений = СтатусЗавершения.Результат;
	
	НайденныеСтроки = ТаблицаПриложений.НайтиСтроки(Новый Структура("ОбластьДанных", НомерОбласти));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Для Каждого Колонка Из ТаблицаПриложений.Колонки Цикл
		Результат.Вставить(Колонка.Имя, НайденныеСтроки[0][Колонка.Имя]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Для выполнения в Фоновом задании.
//
Функция ПроверитьПодключениеККорреспонденту(НастройкиПодключенияВСервисе) Экспорт
	
	НастройкиПодключения = ТранспортСообщенийОбменаКлиентСервер.СтруктураНастроекПодключения();
	
	НастройкиПодключения.ВариантРаботыМастера = "НоваяСинхронизация";
	НастройкиПодключения.ИдентификаторНастройки = ВариантНастройкиОбмена();
	НастройкиПодключения.ИмяПланаОбмена = ИмяПланаОбмена();
	НастройкиПодключения.ИмяПланаОбменаКорреспондента = ИмяПланаОбмена();
	НастройкиПодключения.ФорматОбмена = ФорматОбмена();
	
	НастройкиПодключения.ИдентификаторТранспорта = "SM";
	
	НастройкиПодключения.НастройкиТранспорта.Вставить("ВнутренняяПубликация", (НастройкиПодключенияВСервисе.ДоступенExchangeAdministrationManage_3_0_1_1 = Истина));
	НастройкиПодключения.НастройкиТранспорта.Вставить("КонечнаяТочка", НастройкиПодключенияВСервисе.КонечнаяТочка);
	НастройкиПодключения.НастройкиТранспорта.Вставить("КонечнаяТочкаКорреспондента", НастройкиПодключенияВСервисе.КонечнаяТочкаКорреспондента);
	НастройкиПодключения.НастройкиТранспорта.Вставить("НаименованиеКорреспондента", НастройкиПодключенияВСервисе.НаименованиеПриложения);
	НастройкиПодключения.НастройкиТранспорта.Вставить("ОбластьДанныхКорреспондента", НастройкиПодключенияВСервисе.ОбластьДанных);
	
	Префикс = ПолучитьФункциональнуюОпцию("ПрефиксИнформационнойБазы");
	Если ПустаяСтрока(Префикс) Тогда
		ОбменДаннымиПереопределяемый.ПриОпределенииПрефиксаИнформационнойБазыПоУмолчанию(Префикс);
	КонецЕсли;
	
	НастройкиПодключения.ИдентификаторИнформационнойБазыИсточника = ОбменДаннымиСервер.КодПредопределенногоУзлаПланаОбмена(ИмяПланаОбмена());
	НастройкиПодключения.ПрефиксИнформационнойБазыИсточника = Префикс;
	НастройкиПодключения.НаименованиеЭтойБазы = РаботаВМоделиСервиса.ПолучитьИмяПриложения();
	
	МодульПомощника = ОбменДаннымиСервер.МодульПомощникСозданияОбменаДанными();
	
	НастройкиКорреспондента = МодульПомощника.ПолучениеПараметровКорреспондента(НастройкиПодключения);
	
	Возврат Новый Структура("НастройкиКорреспондента,НастройкиПодключенияВСервисе", НастройкиКорреспондента, НастройкиПодключенияВСервисе);
	
КонецФункции

// Для выполнения в Фоновом задании.
//
Функция СохранитьНастройкиПодключения(СтруктураНастроек) Экспорт
	
	НастройкиКорреспондента = СтруктураНастроек.НастройкиКорреспондента;
	НастройкиПодключенияВСервисе = СтруктураНастроек.НастройкиПодключенияВСервисе;
	
	ПроверкаПодключенияВыполнена = НастройкиКорреспондента.ПодключениеУстановлено
		И НастройкиКорреспондента.ПодключениеРазрешено;
		
	Если Не ПроверкаПодключенияВыполнена Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МодульПомощника = ОбменДаннымиСервер.МодульПомощникСозданияОбменаДанными();
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено);
	
	НастройкиПодключения = СтруктураПараметровСозданияПодключенияВСервисе(НастройкиКорреспондента.ПараметрыКорреспондента, НастройкиПодключенияВСервисе);
	
	ЗаполнитьЗначенияСвойств(НастройкиПодключения, НастройкиКорреспондента, "УзелКорреспондентаЕстьВЭтойБазе,ЭтотУзелЕстьВКорреспонденте");
	НастройкиПодключения.ИсправитьДублированиеНастроекСинхронизации = Ложь;
	
	Возврат МодульПомощника.СохранитьНастройкиПодключения(НастройкиПодключения);
	
КонецФункции

// Для выполнения в Фоновом задании.
//
Процедура СохранитьНачальныеНастройкиСинхронизации(НастройкаСсылка) Экспорт
	
	УзелОбмена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаСсылка, "УзелОбмена");
	
	НастройкиСинхронизации = Новый Структура;
	НастройкиСинхронизации.Вставить("НастройкаСинхронизацииЗавершена", Истина);
	НастройкиСинхронизации.Вставить("ПравилаОтправкиСправочников", "НеСинхронизировать");
	НастройкиСинхронизации.Вставить("ПравилаОтправкиДокументов", "НеСинхронизировать");
	НастройкиСинхронизации.Вставить("ПравилаОтправкиЦен", "НеСинхронизировать");
	
	УстановитьПривилегированныйРежим(Истина);
	ОписаниеПодключения = СовместноеИспользованиеИнтеграция.НовоеПодключениеКСервису();
	УстановитьПривилегированныйРежим(Ложь);
	
	Результат = СовместноеИспользованиеИнтеграция.УстановитьНастройкиСовместногоИспользования(ОписаниеПодключения, НастройкаСсылка, НастройкиСинхронизации);
	
	ОписаниеПодключения.ЗавершитьСеанс = Истина;
	СовместноеИспользованиеИнтеграция.ВерсияИнтерфейса(ОписаниеПодключения);
	
	Если Результат <> Истина Тогда
		ВызватьИсключение НСтр("ru = 'Настройки отражения в бухгалтерии не сохранены.'");
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", УзелОбмена);
		
		Блокировка.Заблокировать();
		
		УзелОбъект = УзелОбмена.ПолучитьОбъект();
		
		УзелОбъект.ПравилаОтправкиСправочников = "СинхронизироватьПоНеобходимости";
		УзелОбъект.ПравилаОтправкиДокументов = "ИнтерактивнаяСинхронизация";
		
		УзелОбъект.ОбменДанными.Загрузка = Истина;
		УзелОбъект.Записать();
		
		ОбменДаннымиСервер.ЗавершитьНастройкуСинхронизацииДанных(УзелОбмена);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Для выполнения в Фоновом задании.
//
Функция ВыполнитьВыгрузкуЗарегистрированныхДанныхДляСопоставления(УзелОбмена) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеВыгружены",   Истина);
	Результат.Вставить("СообщениеОбОшибке", "");
	
	ПериодПроверки = 15; // в секундах
	ДлительностьОжидания = 60 * 60; // в секундах
	
	КоличествоПроверок = Цел(ДлительностьОжидания / ПериодПроверки) + 1;
	
	ОбменЗапланирован = Неопределено;
	Пока КоличествоПроверок > 0 Цикл
		ОбменЗапланирован = ОбменДаннымиВнутренняяПубликация.ПоУзлуЗапланированОбмен(УзелОбмена);
		Если Не ОбменЗапланирован Тогда
			Прервать;
		КонецЕсли;
		КоличествоПроверок = КоличествоПроверок - 1;
		ОбменДаннымиСервер.Пауза(ПериодПроверки);
	КонецЦикла;
	
	Если ОбменЗапланирован = Истина Тогда
		Результат.ДанныеВыгружены = Ложь;
		Результат.СообщениеОбОшибке = НСтр("ru = 'Истекло время ожидания начала отправки данных для сопоставления.'");
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыОбмена = ОбменДаннымиСервер.ПараметрыОбмена();
	ПараметрыОбмена.ВыполнятьЗагрузку = Ложь;
	ПараметрыОбмена.ВыполнятьВыгрузку = Истина;
	ПараметрыОбмена.ИдентификаторТранспорта = "SM";
	ПараметрыОбмена.СообщениеДляСопоставленияДанных = Истина;
	
	Отказ = Ложь;
	Попытка
		ОбменДаннымиСервер.ВыполнитьОбменДаннымиДляУзлаИнформационнойБазы(УзелОбмена, ПараметрыОбмена, Отказ);
	Исключение
		Результат.ДанныеВыгружены = Ложь;
		Результат.СообщениеОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(ОбменДаннымиСервер.СобытиеЖурналаРегистрацииВыгрузкаДанныхДляСопоставления(),
			УровеньЖурналаРегистрации.Ошибка, , , Результат.СообщениеОбОшибке);
	КонецПопытки;
		
	Результат.ДанныеВыгружены = Результат.ДанныеВыгружены И Не Отказ;
	
	Если Не Результат.ДанныеВыгружены
		И ПустаяСтрока(Результат.СообщениеОбОшибке) Тогда
		Результат.СообщениеОбОшибке = НСтр("ru = 'При выполнении выгрузки данных для сопоставления возникли ошибки (см. Журнал регистрации).'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Для выполнения в Фоновом задании.
//
Функция ВыполнитьСинхронизациюЗарегистрированныхДанных(УзелОбмена) Экспорт
	
	ПараметрыОбмена = Неопределено;
	
	МодульОбменДаннымиВнутренняяПубликация = ОбщегоНазначения.ОбщийМодуль("ОбменДаннымиВнутренняяПубликация");
	МодульОбменДаннымиВнутренняяПубликация.ВыполнитьОбменДаннымиВручную(УзелОбмена, ПараметрыОбмена);
	
	ПродолжитьОжидание = Ложь;
	МодульОбменДаннымиВнутренняяПубликация.ПриОжиданииВыгрузкиДанных(ПараметрыОбмена, ПродолжитьОжидание);
	
	Пока ПродолжитьОжидание Цикл
		ОбменДаннымиСервер.Пауза(1);
		МодульОбменДаннымиВнутренняяПубликация.ПриОжиданииВыгрузкиДанных(ПараметрыОбмена, ПродолжитьОжидание);
	КонецЦикла;
	
	Если Не ПараметрыОбмена.Отказ Тогда
		ПараметрыОбмена = Неопределено;
	
		МодульОбменДаннымиВнутренняяПубликация.ВыполнитьОбменДаннымиВручную(УзелОбмена, ПараметрыОбмена);
		
		ПродолжитьОжидание = Ложь;
		МодульОбменДаннымиВнутренняяПубликация.ПриОжиданииВыгрузкиДанных(ПараметрыОбмена, ПродолжитьОжидание);
		
		Пока ПродолжитьОжидание Цикл
			ОбменДаннымиСервер.Пауза(1);
			МодульОбменДаннымиВнутренняяПубликация.ПриОжиданииВыгрузкиДанных(ПараметрыОбмена, ПродолжитьОжидание);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Не ПараметрыОбмена.Отказ;
	
КонецФункции

// Для выполнения в Фоновом задании.
//
Процедура ВыполнитьСценарийСинхронизацииДанных(Сценарий) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КодСценария = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "Код");
	
	ОбменДаннымиВнутренняяПубликация.ВыполнитьОбменДаннымиПоСценарию(КодСценария);
	
КонецПроцедуры

Функция ОсновнойСценарийСинхронизации(УзелОбмена) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СценарииОбменовДанными.Ссылка КАК Ссылка,
	|	СценарииОбменовДанными.ИспользоватьРегламентноеЗадание КАК ИспользоватьРегламентноеЗадание,
	|	СценарииОбменовДанными.ОтключенАвтоматически КАК ОтключенАвтоматически
	|ИЗ
	|	Справочник.СценарииОбменовДанными КАК СценарииОбменовДанными
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СценарииОбменовДанными.НастройкиОбмена КАК СценарииОбменовДаннымиНастройкиОбмена1
	|		ПО (СценарииОбменовДаннымиНастройкиОбмена1.Ссылка = СценарииОбменовДанными.Ссылка)
	|			И (СценарииОбменовДаннымиНастройкиОбмена1.УзелИнформационнойБазы = &УзелОбмена)
	|			И (СценарииОбменовДаннымиНастройкиОбмена1.НомерСтроки = 1)
	|			И (СценарииОбменовДаннымиНастройкиОбмена1.ВыполняемоеДействие = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СценарииОбменовДанными.НастройкиОбмена КАК СценарииОбменовДаннымиНастройкиОбмена2
	|		ПО (СценарииОбменовДаннымиНастройкиОбмена2.Ссылка = СценарииОбменовДанными.Ссылка)
	|			И (СценарииОбменовДаннымиНастройкиОбмена2.УзелИнформационнойБазы = &УзелОбмена)
	|			И (СценарииОбменовДаннымиНастройкиОбмена2.НомерСтроки = 2)
	|			И (СценарииОбменовДаннымиНастройкиОбмена2.ВыполняемоеДействие = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|ГДЕ
	|	НЕ СценарииОбменовДанными.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка");
	
	Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура("Ссылка,ИспользоватьРегламентноеЗадание,ОтключенАвтоматически");
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
		Возврат Результат;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОписаниеОрганизации(Организация, ОшибкиПроверкиЗаполнения = Неопределено) Экспорт
	
	ОшибкиПроверкиЗаполнения = Новый Массив;
	
	ОписаниеОрганизации = Новый Структура;
	ОписаниеОрганизации.Вставить("guid", XMLСтрока(Организация));
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Организация,
		"ЮридическоеФизическоеЛицо,НаименованиеСокращенное,НаименованиеПолное,Наименование,Префикс,ИНН,КПП,ФизическоеЛицо,ИПИспользуетТрудНаемныхРаботников");
		
	Если РеквизитыОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		Если ПустаяСтрока(РеквизитыОрганизации.ИНН) Тогда
			ОшибкиПроверкиЗаполнения.Добавить(НСтр("ru = 'Не заполнен ИНН'"));
		ИначеЕсли СтрДлина(РеквизитыОрганизации.ИНН) <> 10 Тогда
			ОшибкиПроверкиЗаполнения.Добавить(НСтр("ru = 'ИНН юридического лица должен состоять из 10 символов'"));
		КонецЕсли;
		Если ПустаяСтрока(РеквизитыОрганизации.КПП) Тогда
			ОшибкиПроверкиЗаполнения.Добавить(НСтр("ru = 'Не заполнен КПП'"));
		ИначеЕсли СтрДлина(РеквизитыОрганизации.КПП) <> 9 Тогда
			ОшибкиПроверкиЗаполнения.Добавить(НСтр("ru = 'КПП должен состоять из 9 символов'"));
		КонецЕсли;
		
		СвойстваЮрЛица = Новый Структура;
		СвойстваЮрЛица.Вставить("inn", РеквизитыОрганизации.ИНН);
		СвойстваЮрЛица.Вставить("kpp", РеквизитыОрганизации.КПП);
		
		ОписаниеОрганизации.Вставить("organization", СвойстваЮрЛица);
	ИначеЕсли РеквизитыОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		Если ПустаяСтрока(РеквизитыОрганизации.ИНН) Тогда
			ОшибкиПроверкиЗаполнения.Добавить(НСтр("ru = 'Не заполнен ИНН'"));
		ИначеЕсли СтрДлина(РеквизитыОрганизации.ИНН) <> 12 Тогда
			ОшибкиПроверкиЗаполнения.Добавить(НСтр("ru = 'ИНН физического лица должен состоять из 12 символов'"));
		КонецЕсли;
		
		СвойстваФизЛица = Новый Структура;
		СвойстваФизЛица.Вставить("inn", РеквизитыОрганизации.ИНН);
		
		ЗаписиФИО = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(, Новый Структура("ФизическоеЛицо", РеквизитыОрганизации.ФизическоеЛицо));
		Если ЗаписиФИО.Количество() > 0 Тогда
			ЗаписьФИО = ЗаписиФИО[0];
			
			ФИОФизЛица = Новый Структура;
			ФИОФизЛица.Вставить("second_name", ЗаписьФИО.Фамилия);
			ФИОФизЛица.Вставить("first_name", ЗаписьФИО.Имя);
			ФИОФизЛица.Вставить("patronymic", ЗаписьФИО.Отчество);
			
			СвойстваФизЛица.Вставить("name", ФИОФизЛица);
		Иначе
			ОшибкиПроверкиЗаполнения.Добавить(НСтр("ru = 'Не заполнены ФИО физического лица'"));
		КонецЕсли;
		
		СвойстваФизЛица.Вставить("have_staff", РеквизитыОрганизации.ИПИспользуетТрудНаемныхРаботников);
		
		ОписаниеОрганизации.Вставить("entrepreneur", СвойстваФизЛица);
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка при получении ОПФ организации %1'"),
					Организация);
	КонецЕсли;
	
	ОписаниеОрганизации.Вставить("short_name", РеквизитыОрганизации.НаименованиеСокращенное);
	ОписаниеОрганизации.Вставить("full_name", РеквизитыОрганизации.НаименованиеПолное);
	ОписаниеОрганизации.Вставить("nickname", РеквизитыОрганизации.Наименование);
	
	Если ПустаяСтрока(ОписаниеОрганизации.full_name) Тогда
		Если ПустаяСтрока(ОписаниеОрганизации.short_name) Тогда
			ОписаниеОрганизации.full_name = ОписаниеОрганизации.nickname;
		Иначе
			ОписаниеОрганизации.full_name = ОписаниеОрганизации.short_name;
		КонецЕсли;
	КонецЕсли;
	Если ПустаяСтрока(ОписаниеОрганизации.short_name) Тогда
		ОписаниеОрганизации.short_name = ОписаниеОрганизации.full_name;
	КонецЕсли;
	
	ОписаниеОрганизации.Вставить("number_prefix", РеквизитыОрганизации.Префикс);
	ОписаниеОрганизации.Вставить("business_type", "wholesale");
	
	КонтактнаяИнформацияОрганизации = Новый Структура;
	
	ОтборКИ = УправлениеКонтактнойИнформацией.ОтборКонтактнойИнформации();
	ОтборКИ.Дата = ТекущаяДатаСеанса();
	ОтборКИ.ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	ОтборКИ.ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
	ОтборКИ.ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации);
	ОтборКИ.ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	ОтборКИ.ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.EmailОрганизации);
	
	ТаблицаКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформация(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация), ОтборКИ);
	Для Каждого СтрокаКИ Из ТаблицаКИ Цикл
		Если СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации Тогда
			КонтактнаяИнформацияОрганизации.Вставить("legal_address", СтрокаКИ.Значение);
		ИначеЕсли СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации Тогда
			КонтактнаяИнформацияОрганизации.Вставить("actual_address", СтрокаКИ.Значение);
		ИначеЕсли СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации Тогда
			КонтактнаяИнформацияОрганизации.Вставить("post_address", СтрокаКИ.Значение);
		ИначеЕсли СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации Тогда
			КонтактнаяИнформацияОрганизации.Вставить("phone", СтрокаКИ.Значение);
		ИначеЕсли СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.EmailОрганизации Тогда
			КонтактнаяИнформацияОрганизации.Вставить("email", СтрокаКИ.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ОписаниеОрганизации.Вставить("contact_info", КонтактнаяИнформацияОрганизации);
	
	ТаблицаСНО = РегистрыСведений.СистемыНалогообложенияОрганизаций.СрезПоследних(ТекущаяДатаСеанса(), Новый Структура("Организация", Организация));
	
	Если ТаблицаСНО.Количество() > 0 Тогда
		УчетнаяПолитикаОрганизации = ТаблицаСНО[0];
		
		СистемаНалогообложенияСтрокой = "";
	
		Если УчетнаяПолитикаОрганизации.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
			Если УчетнаяПолитикаОрганизации.ОбъектНалогообложения = Перечисления.ВидыОбъектовНалогообложения.Доходы Тогда
				СистемаНалогообложенияСтрокой = "УпрощеннаяДоходы";
			Иначе
				СистемаНалогообложенияСтрокой = "УпрощеннаяДоходыМинусРасходы";
			КонецЕсли;
		ИначеЕсли УчетнаяПолитикаОрганизации.СистемаНалогообложения = Перечисления.СистемыНалогообложения.АУСН Тогда
			Если УчетнаяПолитикаОрганизации.ОбъектНалогообложения = Перечисления.ВидыОбъектовНалогообложения.Доходы Тогда
				СистемаНалогообложенияСтрокой = "АУСНДоходы";
			Иначе
				СистемаНалогообложенияСтрокой = "АУСНДоходыМинусРасходы";
			КонецЕсли;
		ИначеЕсли УчетнаяПолитикаОрганизации.СистемаНалогообложения = Перечисления.СистемыНалогообложения.ОсобыйПорядок Тогда
			СистемаНалогообложенияСтрокой = "Патентная";
		ИначеЕсли УчетнаяПолитикаОрганизации.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая Тогда
			СистемаНалогообложенияСтрокой = "Общая";
		КонецЕсли;
		
		СтруктураУчетнойПолитики = Новый Структура;
		Если УчетнаяПолитикаОрганизации.Период <> Неопределено Тогда
			СтруктураУчетнойПолитики.Вставить("period", УчетнаяПолитикаОрганизации.Период);
		КонецЕсли;
		Если Не ПустаяСтрока(СистемаНалогообложенияСтрокой) Тогда
			СтруктураУчетнойПолитики.Вставить("tax_system", СистемаНалогообложенияСтрокой);
		КонецЕсли;
		Если УчетнаяПолитикаОрганизации.ПрименяетсяПатент <> Неопределено Тогда
			СтруктураУчетнойПолитики.Вставить("patent", УчетнаяПолитикаОрганизации.ПрименяетсяПатент);
		КонецЕсли;
		Если УчетнаяПолитикаОрганизации.ПлательщикТорговыйСбор <> Неопределено Тогда
			СтруктураУчетнойПолитики.Вставить("sales_tax", УчетнаяПолитикаОрганизации.ПлательщикТорговыйСбор);
		КонецЕсли;
		
		ОписаниеОрганизации.Вставить("accounting_policy", СтруктураУчетнойПолитики);
	КонецЕсли;
	
	Возврат ОписаниеОрганизации;
	
КонецФункции

Процедура ЗафиксироватьВыгрузкуОрганизации(Организация, ИдентификаторОрганизации, УзелОбмена)
	
	РегистрыСведений.ДанныеОбъектовДляРегистрацииВОбменах.ДобавитьОбъектВФильтрРазрешенныхОбъектов(Организация, УзелОбмена);
		
	ВыгружаемыйОбъект = Организация.ПолучитьОбъект();
	ОбменДаннымиСобытия.ВыполнитьПравилаРегистрацииДляОбъекта(ВыгружаемыйОбъект, ИмяПланаОбмена());
	
	СтруктураЗаписиРПИ = Новый Структура;
	СтруктураЗаписиРПИ.Вставить("Идентификатор", ИдентификаторОрганизации);
	СтруктураЗаписиРПИ.Вставить("Ссылка", Организация);
	СтруктураЗаписиРПИ.Вставить("УзелИнформационнойБазы", УзелОбмена);
	
	РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ДобавитьЗапись(СтруктураЗаписиРПИ);
	
КонецПроцедуры

#Область ПодсистемаОбменДанными

Функция СтруктураПараметровСозданияПодключенияВСервисе(ПараметрыКорреспондента, НастройкиПодключенияВСервисе)
	
	ИдентификаторИнформационнойБазыИсточника = ОбменДаннымиСервер.КодПредопределенногоУзлаПланаОбмена(ИмяПланаОбмена());
	ИдентификаторИнформационнойБазыПриемника = ПараметрыКорреспондента.КодЭтогоУзла;
	
	Префикс = ПолучитьФункциональнуюОпцию("ПрефиксИнформационнойБазы");
	Если ПустаяСтрока(Префикс) Тогда
		ОбменДаннымиПереопределяемый.ПриОпределенииПрефиксаИнформационнойБазыПоУмолчанию(Префикс);
	КонецЕсли;
	
	ПрефиксКорреспондента = ПараметрыКорреспондента.ПрефиксИнформационнойБазы;
	Если ПустаяСтрока(ПрефиксКорреспондента) Тогда
		ПрефиксКорреспондента = ПараметрыКорреспондента.ПрефиксИнформационнойБазыПоУмолчанию;
	КонецЕсли;
	
	ВерсияФорматаОбмена = ОбменДаннымиXDTOСервер.МаксимальнаяОбщаяВерсияФормата(
		ИмяПланаОбмена(),
		ПараметрыКорреспондента.ВерсииФорматаОбмена);
	
	ПоддерживаемыеОбъектыФорматаКорреспондента = Новый ХранилищеЗначения(ПараметрыКорреспондента.ПоддерживаемыеОбъектыФормата, Новый СжатиеДанных(9));
	
	СтруктураНастроекПомощника = ТранспортСообщенийОбменаКлиентСервер.СтруктураНастроекПодключения();
	
	СтруктураНастроекПомощника.ВариантРаботыМастера = "НоваяСинхронизация";
	СтруктураНастроекПомощника.ИдентификаторНастройки = ВариантНастройкиОбмена();
	СтруктураНастроекПомощника.ВариантНастройкиОбмена = ВариантНастройкиОбмена();
	СтруктураНастроекПомощника.ИмяПланаОбмена = ИмяПланаОбмена();
	СтруктураНастроекПомощника.ИмяПланаОбменаКорреспондента = ИмяПланаОбмена();
	СтруктураНастроекПомощника.ФорматОбмена = ФорматОбмена();
	
	СтруктураНастроекПомощника.ИдентификаторТранспорта = "SM";
	
	СтруктураНастроекПомощника.НастройкиТранспорта.Вставить("ВнутренняяПубликация", (НастройкиПодключенияВСервисе.ДоступенExchangeAdministrationManage_3_0_1_1 = Истина));
	СтруктураНастроекПомощника.НастройкиТранспорта.Вставить("КонечнаяТочка", НастройкиПодключенияВСервисе.КонечнаяТочка);
	СтруктураНастроекПомощника.НастройкиТранспорта.Вставить("КонечнаяТочкаКорреспондента", НастройкиПодключенияВСервисе.КонечнаяТочкаКорреспондента);
	СтруктураНастроекПомощника.НастройкиТранспорта.Вставить("НаименованиеКорреспондента", НастройкиПодключенияВСервисе.НаименованиеПриложения);
	СтруктураНастроекПомощника.НастройкиТранспорта.Вставить("ОбластьДанныхКорреспондента", НастройкиПодключенияВСервисе.ОбластьДанных);
	
	СтруктураНастроекПомощника.ИдентификаторИнформационнойБазыИсточника = ИдентификаторИнформационнойБазыИсточника;
	СтруктураНастроекПомощника.ИдентификаторИнформационнойБазыПриемника = ИдентификаторИнформационнойБазыПриемника;
	
	СтруктураНастроекПомощника.ПрефиксИнформационнойБазыИсточника = Префикс;
	СтруктураНастроекПомощника.ПрефиксИнформационнойБазыПриемника = ПрефиксКорреспондента;
	
	СтруктураНастроекПомощника.НаименованиеЭтойБазы = РаботаВМоделиСервиса.ПолучитьИмяПриложения();
	СтруктураНастроекПомощника.НаименованиеВторойБазы = НастройкиПодключенияВСервисе.НаименованиеПриложения;
	
	СтруктураНастроекПомощника.КодУзла = ИдентификаторИнформационнойБазыИсточника;
	СтруктураНастроекПомощника.КодУзлаКорреспондента = ИдентификаторИнформационнойБазыПриемника;
	
	СтруктураНастроекПомощника.КодПредопределенногоУзла = ИдентификаторИнформационнойБазыИсточника;	
	СтруктураНастроекПомощника.КодНовогоУзлаВторойБазы = ИдентификаторИнформационнойБазыПриемника;
	
	СтруктураНастроекПомощника.ВерсияФорматаОбмена = ВерсияФорматаОбмена;
	СтруктураНастроекПомощника.ПоддерживаемыеОбъектыФормата = ПоддерживаемыеОбъектыФорматаКорреспондента;
	
	СтруктураНастроекПомощника.ВерсияФорматаФайлаНастроекОбменаДанными = ПараметрыКорреспондента.ВерсияФорматаНастроекОбменаДанными;
	
	Возврат СтруктураНастроекПомощника;
	
КонецФункции

Функция ИмяПланаОбмена()
	
	Возврат "СинхронизацияДанныхЧерезУниверсальныйФормат";
	
КонецФункции

Функция ВариантНастройкиОбмена()
	
	Возврат "ОбменУНФ_БП3";
	
КонецФункции

Функция ФорматОбмена()
	
	Возврат "http://v8.1c.ru/edi/edi_stnd/EnterpriseData";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
